ci/app/Models/MitgliederModel.php

    function login($username) {
        $personen = $this->db->table('mitglieder');
        $personen->select('passwort');
        $personen->where('mitglieder.username', $username);
        $result = $personen->get();
---
SELECT `passwort`
FROM `mitglieder`
WHERE `mitglieder`.`username` = 'jumbotron'

    function get_user($user_id) {
        $personen = $this->db->table('mitglieder');
        $personen = $personen->select('*');

        if ($user_id != NULL) {
            $personen = $personen->where('id', $user_id);
        }
        $result = $personen->get();
---
SELECT *
FROM `mitglieder`
WHERE `id` = '1'

    function get_user_by_name($username) {
        $personen = $this->db->table('mitglieder');
        $personen = $personen->select('*');

        if ($username != NULL) {
            $personen = $personen->where('username', $username);
        }
        $result = $personen->get();
---
SELECT *
FROM `mitglieder`
WHERE `username` = 'jumbotron'