ci/app/Models/ProjektModel.php

SELECT *
FROM `projekte`
WHERE `id` = '5'
---
    function get_projekt($projekt_id) {
        $projekte = $this->db->table('projekte');
        $projekte = $projekte->select('*');

        if ($projekt_id != NULL) {
            $projekte = $projekte->where('id', $projekt_id);
        }
        $result = $projekte->get();

DELETE FROM `projekte`
WHERE `id` = '14'
---
    function delete_projekt_by_id($projekt_id) {
        $projekte = $this->db->table('projekte');
        $projekte = $projekte->select('*');
        $projekt_to_delete = $projekte->where('id', $projekt_id);
        $projekt_to_delete->delete();

INSERT INTO `projekte` (`name`, `beschreibung`, `ersteller`) VALUES ('Test', 't', '29')
---
    function create_projekt($name, $beschreibung, $ersteller_name) {
        $mitglieder = new MitgliederModel();
        $projekte = $this->db->table('projekte');
        $ersteller = $mitglieder->get_user_by_name($ersteller_name);
        $projekte->insert(array(
            'name' => $name,
            'beschreibung' => $beschreibung,
            'ersteller' => $ersteller['id']
        ));