ci/app/Models/ReiterModel.php

INSERT INTO `reiter` (`name`, `beschreibung`) VALUES ('Testreiter', 't')
INSERT INTO `reiter_projekt` (`reiter_id`, `projekt_id`) VALUES ('18', '14')
---
    function addData() {
        $reiter = $this->db->table('reiter');
        $reiter_projekt = $this->db->table('reiter_projekt');
        $reiter->insert(array(
            'name' => $_POST['name'],
            'beschreibung' => $_POST['beschreibung']
        ));
        $reiter_projekt->insert(array(
            'reiter_id' => $this->get_reiter_by_name($_POST['name'])['id'],
            'projekt_id' => $_SESSION['chosen_projekt']
        ));

SELECT *
FROM `reiter`
WHERE `name` = 'Testreiter'
---
    function get_reiter_by_name($name) {
        $reiter = $this->db->table('reiter');
        $reiter = $reiter->select('*');

        if ($name != NULL) {
            $reiter = $reiter->where('name', $name);
        }
        $result = $reiter->get();